Revit 2024 API
DoubleArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Insert(
	ref double item,
	int index
)
Visual Basic
Public Overridable Sub Insert ( _
	ByRef item As Double, _
	index As Integer _
)
Visual C++
public:
virtual void Insert(
	double% item,
	int index
)
Parameters
item
Type: System.Double
index
Type: System.Int32
See Also
DoubleArray Class
Autodesk.Revit.DB Namespace